cask_args appdir: '/Applications'

tap 'caskroom/cask'

cask 'java'

brew 'yarn'
brew 'maven'
brew 'gradle'
brew 'lastpass-cli'

# JetBrains
cask 'intellij-idea'
cask 'webstorm'
cask 'pycharm'

# Database Client
cask 'dbeaver-enterprise'

cask 'google-chrome'
cask 'sourcetree'
cask 'atom'
cask 'docker'
cask 'appcleaner'
cask 'shiftit'
