cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'neovim/neovim'

cask 'java'

brew 'yarn'
brew 'maven'
brew 'gradle'
brew 'lastpass-cli'
brew 'vagrant-completion'
brew 'carthage'
brew 'rclone'
brew 'percona-toolkit'
brew 'neovim'
brew 'tmux'

# JetBrains
cask 'intellij-idea'
cask 'webstorm'
cask 'pycharm'

# Database Client
cask 'dbeaver-enterprise'

cask 'google-chrome'
cask 'sourcetree'
cask 'atom'
cask 'docker'
cask 'appcleaner'
cask 'shiftit'
cask 'viscosity'
cask 'adobe-reader'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vagrant'
cask 'vagrant-manager'
cask 'zeplin'
cask 'rclone-browser'
cask 'tunnelblick'
cask 'visual-studio-code'
