cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'neovim/neovim'
tap 'caskroom/drivers'

cask 'java'

brew 'yarn'
brew 'maven'
brew 'gradle'
brew 'vagrant-completion'
brew 'carthage'
brew 'rclone'
brew 'percona-toolkit'
brew 'neovim'
brew 'gnu-sed', args: ["with-default-names"]
brew 'watchman'
brew 'm-cli'
brew 'python3'

# Web Browser
cask 'google-chrome'

# JetBrains
cask 'intellij-idea'
cask 'webstorm'
cask 'pycharm'
cask 'android-studio'

# Database Client
cask 'dbeaver-community'
cask 'staruml'

# Other Developer Tools
cask 'sourcetree'
cask 'docker'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vagrant'
cask 'vagrant-manager'
cask 'tunnelblick'
cask 'visual-studio-code'
cask 'android-platform-tools'

# Remote
cask 'nomachine'

# Security
cask 'keybase'

# Drivers
cask 'logitech-options'

# Utilities
cask 'shiftit'
cask 'appcleaner'

# Cloud Drive
cask 'amazon-drive'
cask 'rclone-browser'

# Graphic Design
cask 'gimp'
cask 'zeplin'

# Office
cask 'adobe-acrobat-reader'
